{
    "techstack": [
        { "title": "Языки", "parts": "HTML5, CSS3 (SCSS), JavaScript (ES6)" },
        { "title": "Клиентская часть", "parts": "React, Redux Toolkit" },
        { "title": "Серверная часть", "parts": "NodeJS, Express" },
        { "title": "Базы данных", "parts": "MongoDB" },
        { "title": "Утилиты", "parts": "Git / GitHub, Insomnia, Compass" }
    ],
    "portfolio": [
        {
            "title": "pizza_market",
            "links": {
                "global": "https://mfdevpizzamarket.vercel.app/",
                "github": "https://github.com/mfdevgit/pizza_market"
            },
            "description": "Клиентская часть интернет-магазина доставки пиццы. Адаптирована под устройства с любыми экранами. Есть API для получения данных о продукции, акциях и прочем. Много функционала, связанного с работой глобального состояния. Используется модульная система стилей. Можно посмотреть в работе на Vercel, а подробное описание можно увидеть в репозитории или на главной странице приложения.",
            "stack": ["react", "redux", "axios", "dotenv", "helmet", "spinners", "scss"]
        },
        {
            "title": "utilities",
            "links": {
                "global": "https://mfdevutilities.vercel.app/",
                "github": "https://github.com/mfdevgit/utilities"
            },
            "description": "Приятный <b>фронтенд</b> на React, где я собрал функционал для личного использования. Выложен на Vercel. На текущий момент есть генератор паролей, собрание градиентов, список задач (todo list).",
            "stack": ["react", "sass", "helmet", "spinners"]
        },
        {
            "title": "backbone",
            "links": {
                "global": null,
                "github": "https://github.com/mfdevgit/backbone"
            },
            "description": "Общий <b>бэкенд</b> для личных проектов. Сделан на NodeJS и Express, использует MongoDB. Принимает 4 типа HTTP-запросов. Добавлен мидлвар, проверяющий наличие токена для некоторых запросов.",
            "stack": ["nodejs", "express", "cors", "mongoose", "jsonwebtoken"]
        }
    ],
    "hobby": [
        "Конечно, <b>нейросети</b>. В частности, ChatGPT и Midjourney. Первая просто фантастически помогает в обучении, вторая - помогает создавать контент для собственных проектов и делает их куда интереснее визуально.",
        "Со школьных лет мне нравится играть в <b>баскетбол</b>, но соревнования остались в прошлом.",
        "Стал чаще <b>читать</b> публицистику, хотя раньше предпочитал зарубежную художественную литературу.",
        "В моей квартире много <b>растений</b>, выращенных из маленького зёрнышка.",
        "Как программисту без <b>компьютерных игр</b>? Предпочитаю стратегии, хорошие RPG, иногда играем в аркады (футбол на машинках - это лучшее, что придумало человечество).",
        "Некоторое время увлекался <b>столярным ремеслом</b>, благодаря чему не только научился работе с инструментами, но и сколотил себе некоторую мебель."
    ]
}
