import React from 'react'

export default function Hobby() {
    return (
        <div className='hobby'>
            <p>
                Конечно, <b>нейросети</b>. В частности, ChatGPT и Midjourney. Первая просто фантастически помогает в обучении, вторая - помогает
                создавать контент для собственных проектов и делает их куда интереснее визуально.
            </p>
            <p>
                Со школьных лет мне нравится играть в <b>баскетбол</b>, но соревнования остались в прошлом.
            </p>
            <p>
                Стал чаще <b>читать</b> публицистику, хотя раньше предпочитал зарубежную художественную литературу.
            </p>
            <p>
                В моей квартире много <b>растений</b>, выращенных из маленького зёрнышка.
            </p>
            <p>
                Как программисту без <b>компьютерных игр</b>? Предпочитаю стратегии, хорошие RPG, иногда играем в аркады (футбол на машинках - это
                лучшее, что придумало человечество).
            </p>
            <p>
                Некоторое время увлекался <b>столярным ремеслом</b>, благодаря чему не только научился работе с инструментами, но и сколотил себе
                некоторую мебель.
            </p>
        </div>
    )
}
