import React from 'react'

export default function Introduction() {
    return (
        <div className='introduction'>
            <p>
                Я изучаю веб-программирование на протяжении двух лет и за это время не только обрёл необходимые навыки, но и сделал несколько работ,
                которые эти навыки демонстрируют.
            </p>
            <p>
                Помимо разработки бэкенда и фронтенда я испытываю интерес к дизайну (векторная графика), а потому довольно свободно пользуюсь Figma и
                Adobe Illustrator.
            </p>
        </div>
    )
}
