import React from 'react'

export default function Portfolio() {
    return (
        <div className='portfolio'>
            <div>
                <div>
                    <a className='title' target='_blanc' href='https://mfdevutilities.vercel.app/'>
                        Утилиты
                    </a>
                    <a href='https://github.com/mfdevgit/utilities' target='_blanc'>
                        <svg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 50 50'>
                            <path d='m25,2.5C12.57,2.5,2.5,12.57,2.5,25s10.07,22.5,22.5,22.5,22.5-10.07,22.5-22.5S37.43,2.5,25,2.5Zm10.87,18.71c0,6.24-3.71,7.62-7.23,8.01.67.7,1.08,1.66,1.08,2.72,0,.1,0,.2-.01.3h0c0,2.16-.02,3.91-.02,4.44,0,.11.02.22.06.32-1.26.32-2.58.49-3.94.49s-2.71-.18-3.98-.5c.03-.1.05-.2.05-.3,0-.38-.01-1.41-.02-2.76-4.41.98-5.34-2.18-5.34-2.18-.3-1-.93-1.83-1.75-2.37h-.01c-1.44-1.02.11-1,.11-1,1.04.15,1.92.78,2.42,1.66h0c.59,1.09,1.7,1.81,2.97,1.81.61,0,1.18-.17,1.67-.46h-.01c.08-.85.44-1.6,1-2.17-3.52-.4-7.22-1.81-7.22-8.03v-.09c0-1.65.62-3.15,1.63-4.27-.21-.59-.34-1.26-.34-1.97,0-.83.17-1.61.48-2.33,0,0,1.33-.43,4.36,1.67,1.19-.35,2.55-.55,3.97-.55s2.78.2,4.07.58l-.11-.03c3.01-2.1,4.34-1.67,4.34-1.67.3.69.48,1.51.48,2.36,0,.69-.12,1.37-.33,1.99v-.04c1.02,1.12,1.64,2.62,1.64,4.27v.1Z' />
                        </svg>
                    </a>
                </div>
                <p>
                    Самостоятельный проект на React (без бэка), где я собираю функционал для личного использования. Выложен на Vercel. На текущий
                    момент есть генератор паролей и собрание градиентов.
                </p>
            </div>
        </div>
    )
}
